% Зчитування зображення
f = imread('cameraman.tif');

% Обчислення ДПФ та модуля спектра
F = fft2(f);
S = abs(F);

% Логарифмічне перетворення для візуалізації
Slog = log(1 + S);

% % Відображення оригіналу та спектра
% figure, imshow(f); title('Вихідне зображення');
% figure, imshow(Slog, []); title('Спектр зображення без зміщення');

% Центрування спектра
Fc = fftshift(F);
Sc = abs(Fc);
Sclog = log(1 + Sc);

% Відображення центрованого спектра
% figure, imshow(Sclog, []); title('Спектр зображення з центрованою нульовою частотою');

% Повернення спектра до початкового вигляду та ОДПФ
F_back = ifftshift(Fc);
I_restored = ifft2(F_back);

% Відображення результату
% figure, imshow(abs(I_restored), []); title('Зображення після зворотного перетворення');

% Створення гаусівського фільтра НЧ розміром як зображення
[M, N] = size(f);
sigma = 5;
h = fspecial('gaussian', [M N], sigma);

% Отримання частотної характеристики фільтра
H = fft2(h);

% Фільтрація: множення спектрів у частотній області
G = F .* H;

% Повернення в просторову область
f_filtered = ifft2(G);

% Відображення результату
figure, imshow(abs(f_filtered), []); title('Результат частотної фільтрації (НЧ)');